"use client";
import React, { useState, useEffect } from "react";
import styles from "./Elm-path.module.css";
import {
  FaLeaf,
  FaBalanceScale,
  FaBookOpen,
  FaBook,
} from "react-icons/fa";
import BackgroundIcons from "@/components/background/BackgroundIcons";

const data = {
  shar3i_path: [

    {stage_name: "مرحلة التأسيس الاولى",
      sections: {
        "مقدمات (1)": [
          "حفظ القرآن",
          "أصول الدين ١: ثلاثة الأصول",
          "طلب العلم وآدابه ١: خلاصة تعظيم العلم، وأخلاق حملة القرآن، وأخلاق العلماء",
          "متون الحديث ١: الأربعون النووية",
          "الفقه ١ (تجد المتن في صفحة العلوم حسب المذهب)"
        ],
        "آلة  (2)": [
          "التجويد ١: تحفة الأطفال",
          "النحو ١: الآجرومية، ونكتة الإعراب",
          "الصرف ١: بناء الأفعال",
          "البلاغة ١: مائة المعاني والبيان، أو دروس البلاغة",
          "أصول الفقه ١ (تجد المتن في صفحة العلوم حسب المذهب)"
        ],
        "آلة  (3)": [
          "الإملاء ١: قواعد الإملاء، أو بهجة الطلاب",
          "التجويد ٢: الجزرية",
          "النحو ٢: متممة الآجرومية، أو قطر الندى، وقواعد الإعراب",
          "علوم القرآن ١: علم التفسير من النقاية، ومقدمة في أصول التفسير",
          "علوم الحديث ١: البيقونية، أو علم الحديث من النقاية"
        ],
        "مقاصد (4)": [
          "الفقه ٢ (تجد المتن في صفحة العلوم حسب المذهب)",
          "السيرة ١: الأرجوزة الميئية",
          "أصول الدين ٢: كتاب التوحيد، والعقيدة الواسطية",
          "التفسير ١: تفسير الجلالين"
        ]
      }
    },
    { stage_name: "مرحلة التأسيس الثانية",
      sections: {
        "تزكية وتربية (5)": [
          "طلب العلم وآدابه ٢: تذكرة السامع والمتكلم، أو عدة الطلب",
          "تزكية النفس ١: الوصية الصغرى، وكفاية المتعبد، والكلم الطيب",
          "سير ومناقب ١: فضائل الصحابة",
          "الأخلاق والآداب ١: آداب العشرة، ومكارم الأخلاق"
        ],
        "آلة  (6)": [
          "الصرف ٢: تصريف العزي، أو المقصود",
          "القراءات ١: القراءات القرآنية",
          "علوم القرآن ٢: مقدمة تفسير ابن جزي، ومواقع العلوم في مواقع النجوم",
          "علوم الحديث ٢: نخبة الفكر",
          "أصول الفقه ٢ (تجد المتن في صفحة العلوم حسب المذهب)"
        ],
        "آلة  (7)": [
          "أصول البدع ١: قواعد في معرفة البدع",
          "مقاصد الشريعة ١: مدخل إلى علم المقاصد",
          "المفردات ١: رسالة في المترادفات",
          "الأدب ١: بانت سعاد، ولامية العرب",
          "النحو ٣: ألفية ابن مالك"
        ],
        "مقاصد  (8)": [
          "الفقه ٣ (تجد المتن في صفحة العلوم حسب المذهب)",
          "الفرائض ١: الرحبية، أو البرهانية",
          "أحاديث الأحكام ١: عمدة الأحكام"
        ],
        "مقاصد  (9)": [
          "أصول الدين ٣: سلم الوصول، أو العقيدة الطحاوية",
          "التفسير ١: تفسير الجلالين",
          "متون الحديث ٢: رياض الصالحين"
        ]
      }
    },
    { stage_name: "مرحلة التمكين الاولى",
      sections: {
        "تزكية وتربية (10)": [
          "تزكية النفس ٢: الرسالة التبوكية، والعبودية، والداء والدواء",
          "سير ومناقب ٢: صفة الصفوة",
          "الأخلاق والآداب ٢: روضة العقلاء، ومنتقى مكارم الأخلاق"
        ],
        "آلة  (11)": [
          "الصرف ٣: لامية الأفعال، أو عنوان الظرف، أو شذا العرف",
          "البلاغة ٢: البلاغة الواضحة، أو الجوهر المكنون",
          "المفردات ٢: الفصيح",
          "الأدب ٢: المعلقات العشر"
        ],
        "آلة  (12)": [
          "أصول الفقه ٣ (تجد المتن في صفحة العلوم حسب المذهب)",
          "مقاصد الشريعة ٢: مقاصد الشريعة الإسلامية",
          "علوم الحديث ٣: اختصار علوم الحديث، أو تدريب الراوي",
          "المنطق ١: متن إيساغوجي، أو السلم المنورق"
        ],
        "مقاصد  (13)": [
          "الفقه ٤ (تجد المتن في صفحة العلوم حسب المذهب)",
          "أحاديث الأحكام ٢: بلوغ المرام",
          "التفسير ٢: تفسير الإيجي، أو تفسير ابن جزي"
        ],
        "مقاصد  (14)": [
          "السيرة ٢: الفصول في سيرة الرسول، ومختصر الشمائل المحمدية",
          "أصول الدين ٤: الرسالة التدمرية، والفتوى الحموية الكبرى، وقاعدة جليلة في التوسل والوسيلة",
          "متون الحديث ٣: الأصول التسعة"
        ]
      }
    },
    { stage_name: "مرحلة التمكين الثانية",
      sections: {
        "تزكية وتربية (15)": [
          "طلب العلم وآدابه ٣: جامع بيان العلم، والجامع للخطيب",
          "تزكية النفس ٣: مختصر منهاج القاصدين، أو طريق الهجرتين، أو إغاثة اللهفان",
          "سير ومناقب ٣: سير أعلام النبلاء",
          "الأخلاق والآداب ٣: الأدب المفرد"
        ],
        "آلة  (16)": [
          "أصول الفقه ٤ (تجد المتن في صفحة العلوم حسب المذهب)",
          "مقاصد الشريعة ٣: الموافقات، والقواعد الكبرى",
          "أصول البدع ٢: الاعتصام",
          "علوم الحديث ٤: ألفية العراقي، أو ألفية السيوطي، أو علوم الحديث"
        ],
        "آلة  (17)": [
          "البلاغة ٣: التلخيص في علوم البلاغة",
          "علوم القرآن ٣: البرهان، أو الإتقان",
          "المفردات ٣: كفاية المتحفظ، أو عمدة الكُتاب",
          "الإملاء ٢: كتاب الإملاء",
          "الصرف ٤: شافية ابن الحاجب"
        ],
        "مقاصد  (18)": [
          "الفقه ٥ (تجد المتن في صفحة العلوم حسب المذهب)",
          "القواعد والفروق الفقهية (تجد المتن في صفحة العلوم حسب المذهب)",
          "أحاديث الأحكام ٣: منتقى الأخبار",
          "الفرائض ٢: التحقيقات المرضية"
        ],
        "مقاصد  (19)": [
          "أصول الدين ٥: كتاب الاعتقاد للالكائي، واقتضاء الصراط المستقيم، ومختصر منهاج السنة",
          "القراءات ٢: الشاطبية، والدرة المضية",
          "السيرة ٣: ألفية العراقي (الدرر السنية)، أو تهذيب سيرة ابن هشام",
          "التفسير ٣: تفسير ابن كثير"
        ]
      }
    }



  ]
}

export default function ElmPath() {
  const [checkedLessons, setCheckedLessons] = useState<{ [key: string]: boolean }>({});

  useEffect(() => {
    const stored = localStorage.getItem("checkedLessons");
    if (stored) {
      setCheckedLessons(JSON.parse(stored));
    }
  }, []);

  useEffect(() => {
    localStorage.setItem("checkedLessons", JSON.stringify(checkedLessons));
  }, [checkedLessons]);

  const handleCheckboxChange = (e: React.ChangeEvent<HTMLInputElement>) => {
    const key = e.target.value;
    setCheckedLessons(prev => ({
      ...prev,
      [key]: !prev[key],
    }));
  };

  return (
    <div>
      <div className={styles.header}>
        <div className={styles.headerContent}>
          <h1 className={styles.headerTitle}>مسار العلم الشرعي</h1>
          <p className={styles.headerSubtitle}>
            مسار العلم الشرعي هو مسار تعلم العلوم الإسلامية من الصفر.
          </p>
        </div>
      </div>

      <BackgroundIcons>
        <div className={styles.timeline}>
          <div className={styles.timelineLine} />
          {data.shar3i_path.map((stage, i) => (
            <div className={styles.cont} key={i}>
              <h3 className={styles.stageTitle}>{stage.stage_name}</h3>
              <div className={styles.textBox}>
                {Object.entries(stage.sections).map(([title, lessons], j) => (
                  <div
                    className={`${styles.section} ${j % 2 === 0 ? styles.left : styles.right}`}
                    key={j}
                  >
                    <h4 className={styles.sectionTitle}>
                      {title.includes("تزكية") && <FaLeaf className={styles.icon} />}
                      {title.includes("آلة") && <FaBalanceScale className={styles.icon} />}
                      {title.includes("مقاصد") && <FaBookOpen className={styles.icon} />}
                      {title.includes("مقدمات") && <FaBook className={styles.icon} />}
                      {title}
                    </h4>
                    <ul>
                      {lessons.map((lesson: string, k: number) => {
                        const key = `${stage.stage_name}-${title}-${lesson}`;
                        return (
                          <li key={k} className={styles.lesson}>
                            <label>
                              <input
                                type="checkbox"
                                value={key}
                                checked={checkedLessons[key] || false}
                                onChange={handleCheckboxChange}
                                style={{ marginLeft: '10px', marginRight: '10px' }}
                              />
                              {lesson}
                            </label>
                          </li>
                        );
                      })}
                    </ul>
                  </div>
                ))}
              </div>
            </div>
          ))}
        </div>
      </BackgroundIcons>
    </div>
  );
}
